GigaDevice-GD32-MCU/GD32H759_EVAL_LVGL/Utilities/Third_Party/lvgl/demos/benchmark/lv_demo_benchmark.c
/**
 * @file lv_demo_benchmark.c
 *
 */

/*********************
 *      INCLUDES
 *********************/
#include "lv_demo_benchmark.h"
#include "gd32h73x_75x.h"

#if LV_USE_DEMO_BENCHMARK

/*********************
 *      DEFINES
 *********************/
#define RND_NUM         64
#define SCENE_TIME      1000      /*ms*/
#define ANIM_TIME_MIN   ((2 * SCENE_TIME) / 10)
#define ANIM_TIME_MAX   (SCENE_TIME)
#define OBJ_NUM         8
#define OBJ_SIZE_MIN    (LV_MAX(LV_DPI_DEF / 20, 5))
#define OBJ_SIZE_MAX    (LV_HOR_RES / 2)
#define RADIUS          LV_MAX(LV_DPI_DEF / 15, 2)
#define BORDER_WIDTH    LV_MAX(LV_DPI_DEF / 40, 1)
#define SHADOW_WIDTH_SMALL  LV_MAX(LV_DPI_DEF / 15, 5)
#define SHADOW_OFS_X_SMALL  LV_MAX(LV_DPI_DEF / 20, 2)
#define SHADOW_OFS_Y_SMALL  LV_MAX(LV_DPI_DEF / 20, 2)
#define SHADOW_SPREAD_SMALL LV_MAX(LV_DPI_DEF / 30, 2)
#define SHADOW_WIDTH_LARGE  LV_MAX(LV_DPI_DEF / 5,  10)
#define SHADOW_OFS_X_LARGE  LV_MAX(LV_DPI_DEF / 10, 5)
#define SHADOW_OFS_Y_LARGE  LV_MAX(LV_DPI_DEF / 10, 5)
#define SHADOW_SPREAD_LARGE LV_MAX(LV_DPI_DEF / 30, 2)
#define IMG_WIDH        100
#define IMG_HEIGHT      100
#define IMG_NUM         LV_MAX((LV_HOR_RES * LV_VER_RES) / 5 / IMG_WIDH / IMG_HEIGHT, 1)
#define IMG_ZOOM_MIN    128
#define IMG_ZOOM_MAX    (256 + 64)
#define TXT "hello world\nit is a multi line text to test\nthe performance of text rendering"
#define LINE_WIDTH  LV_MAX(LV_DPI_DEF / 50, 2)
#define LINE_POINT_NUM  16
#define LINE_POINT_DIFF_MIN (LV_DPI_DEF / 10)
#define LINE_POINT_DIFF_MAX LV_MAX(LV_HOR_RES / (LINE_POINT_NUM + 2), LINE_POINT_DIFF_MIN * 2)
#define ARC_WIDTH_THIN LV_MAX(LV_DPI_DEF / 50, 2)
#define ARC_WIDTH_THICK LV_MAX(LV_DPI_DEF / 10, 5)

#ifndef dimof
    #define dimof(__array)     (sizeof(__array) / sizeof(__array[0]))
#endif

 LV_IMG_DECLARE(img_home);
 LV_IMG_DECLARE(img_home_pressed);

static lv_obj_t *imgbtn_home;
/**********************
 *      TYPEDEFS
 **********************/

typedef struct {
    const char * name;
    void (*create_cb)(void);
    uint32_t time_sum_normal;
    uint32_t time_sum_opa;
    uint32_t refr_cnt_normal;
    uint32_t refr_cnt_opa;
    uint32_t fps_normal;
    uint32_t fps_opa;
    uint8_t weight;
} scene_dsc_t;

/**********************
 *  STATIC PROTOTYPES
 **********************/

static lv_style_t style_common;
static bool opa_mode = true;
static bool run_max_speed = false;
static bool benchmark_running = false;
static finished_cb_t * benchmark_finished_cb = NULL;
static finished_cb_t * benchmark_exit_cb = NULL;
static uint32_t disp_ori_timer_period;
static uint32_t anim_ori_timer_period;

#if LV_DEMO_BENCHMARK_RGB565A8 && LV_COLOR_DEPTH == 16
    LV_IMG_DECLARE(img_benchmark_cogwheel_rgb565a8);
#else
    LV_IMG_DECLARE(img_benchmark_cogwheel_argb);
#endif
LV_IMG_DECLARE(img_benchmark_cogwheel_rgb);
LV_IMG_DECLARE(img_benchmark_cogwheel_chroma_keyed);
LV_IMG_DECLARE(img_benchmark_cogwheel_indexed16);
LV_IMG_DECLARE(img_benchmark_cogwheel_alpha16);

LV_FONT_DECLARE(lv_font_benchmark_montserrat_12_compr_az);
LV_FONT_DECLARE(lv_font_benchmark_montserrat_16_compr_az);
LV_FONT_DECLARE(lv_font_benchmark_montserrat_28_compr_az);

static void monitor_cb(lv_disp_drv_t * drv, uint32_t time, uint32_t px);
static void scene_next_task_cb(lv_timer_t * timer);
static void rect_create(lv_style_t * style);
static void img_create(lv_style_t * style, const void * src, bool rotate, bool zoom, bool aa);
static void txt_create(lv_style_t * style);
static void line_create(lv_style_t * style);
static void arc_create(lv_style_t * style);
static void fall_anim(lv_obj_t * obj);
static void rnd_reset(void);
static int32_t rnd_next(int32_t min, int32_t max);
static void report_cb(lv_timer_t * timer);
static void create_home_button(lv_obj_t * parent);

static void home_event_cb(lv_event_t *e)
{
    LV_UNUSED(e);
    benchmark_running = false;
    lv_disp_get_default()->driver->monitor_cb = NULL;

    /* Restore the refresh/animation periods if they were forced to max speed. */
    if(run_max_speed) {
        lv_timer_t * anim_timer = lv_anim_get_timer();
        if(anim_timer != NULL && anim_ori_timer_period != 0) {
            lv_timer_set_period(anim_timer, anim_ori_timer_period);
        }
        lv_disp_t * disp = lv_disp_get_default();
        lv_timer_t * refr_timer = _lv_disp_get_refr_timer(disp);
        if(refr_timer != NULL && disp_ori_timer_period != 0) {
            lv_timer_set_period(refr_timer, disp_ori_timer_period);
        }
    }

    /* benchmark_init() stripped every style from the active screen and
     * generate_report() additionally puts a flex layout on it. Leaving that
     * behind makes the page rebuilt by the exit callback flicker and lay out
     * incorrectly, so put the screen back into its default (themed) state. */
    lv_obj_t * scr = lv_scr_act();
    lv_obj_remove_style_all(scr);
    lv_theme_apply(scr);

    imgbtn_home = NULL;

    if(benchmark_exit_cb != NULL) {
        (*benchmark_exit_cb)();
    }
}

static void create_home_button(lv_obj_t * parent)
{
    imgbtn_home = lv_imgbtn_create(parent);
    /* img_home_pressed is a 60x60 asset while img_home is 30x30. lv_imgbtn
     * draws the source at its native size, so using the pressed asset made the
     * button visibly double in size while touched. Use the same 30x30 image
     * for both states. */
    lv_imgbtn_set_src(imgbtn_home, LV_IMGBTN_STATE_PRESSED, &img_home, NULL, NULL);
    lv_imgbtn_set_src(imgbtn_home, LV_IMGBTN_STATE_RELEASED, &img_home, NULL, NULL);
    lv_obj_set_size(imgbtn_home, 30, 30);
    /* The report page uses a flex layout on the screen; keep the exit button
     * out of it so it always stays in the top right corner. */
    lv_obj_add_flag(imgbtn_home, LV_OBJ_FLAG_IGNORE_LAYOUT);
    lv_obj_align(imgbtn_home, LV_ALIGN_TOP_RIGHT, -3, 3);
    lv_obj_move_foreground(imgbtn_home);
    lv_obj_add_event_cb(imgbtn_home, home_event_cb, LV_EVENT_CLICKED, NULL);
}

static void rectangle_cb(void)
{
    lv_style_reset(&style_common);
    lv_style_set_bg_opa(&style_common, opa_mode ? LV_OPA_50 : LV_OPA_COVER);
    rect_create(&style_common);
}

static void rectangle_rounded_cb(void)
{
    lv_style_reset(&style_common);
    lv_style_set_radius(&style_common, RADIUS);
    lv_style_set_bg_opa(&style_common, opa_mode ? LV_OPA_50 : LV_OPA_COVER);
    rect_create(&style_common);
}

static void rectangle_circle_cb(void)
{
    lv_style_reset(&style_common);
    lv_style_set_radius(&style_common, LV_RADIUS_CIRCLE);
    lv_style_set_bg_opa(&style_common, opa_mode ? LV_OPA_50 : LV_OPA_COVER);
    rect_create(&style_common);
}

