GigaDevice-GD32-MCU/GD32H759_EVAL_LVGL/Utilities/Third_Party/lvgl/demos/benchmark/lv_demo_benchmark.c
static void benchmark_init(void)
{
    lv_disp_t * disp = lv_disp_get_default();
    disp->driver->monitor_cb = monitor_cb;
    scene_act = -1;
    opa_mode = true;
    benchmark_running = true;

    /*Force to run at maximum frame rate*/
    if(run_max_speed) {
        if(disp->refr_timer) {
            disp_ori_timer_period = disp->refr_timer->period;
            lv_timer_set_period(disp->refr_timer, 1);
        }

        lv_timer_t * anim_timer = lv_anim_get_timer();
        anim_ori_timer_period = anim_timer->period;
        lv_timer_set_period(anim_timer, 1);
    }

    lv_obj_t * scr = lv_scr_act();
    lv_obj_clean(scr);
    lv_obj_remove_style_all(scr);
    lv_obj_set_style_bg_opa(scr, LV_OPA_COVER, 0);

    title = lv_label_create(scr);
    lv_obj_set_pos(title, LV_DPI_DEF / 30, LV_DPI_DEF / 30);

    subtitle = lv_label_create(scr);
    lv_obj_align_to(subtitle, title, LV_ALIGN_OUT_BOTTOM_LEFT, 0, 0);

    scene_bg = lv_obj_create(scr);
    lv_obj_remove_style_all(scene_bg);
    lv_obj_set_size(scene_bg, lv_obj_get_width(scr), lv_obj_get_height(scr) - subtitle->coords.y2 - LV_DPI_DEF / 30);
    lv_obj_align(scene_bg, LV_ALIGN_BOTTOM_MID, 0, 0);

    create_home_button(scr);

    lv_style_init(&style_common);

    lv_obj_update_layout(scr);
}


void lv_demo_benchmark(void)
{
    benchmark_init();

    /*Manually start scenes*/
    scene_next_task_cb(NULL);
}


void lv_demo_benchmark_run_scene(int_fast16_t scene_no)
{
    benchmark_init();

    if(((scene_no >> 1) >= dimof(scenes))) {
        /* invalid scene number */
        return ;
    }

    opa_mode = scene_no & 0x01;
    scene_act = scene_no >> 1;

    if(scenes[scene_act].create_cb) {
        lv_label_set_text_fmt(title, "%"LV_PRId32"/%d: %s%s", scene_act * 2 + (opa_mode ? 1 : 0), (int)(dimof(scenes) * 2) - 2,
                              scenes[scene_act].name, opa_mode ? " + opa" : "");
        lv_label_set_text(subtitle, "");

        rnd_reset();
        scenes[scene_act].create_cb();

        lv_timer_t * t = lv_timer_create(report_cb, SCENE_TIME, NULL);
        lv_timer_set_repeat_count(t, 1);
    }
}


void lv_demo_benchmark_set_finished_cb(finished_cb_t * finished_cb)
{
    benchmark_finished_cb = finished_cb;
}

void lv_demo_benchmark_set_exit_cb(finished_cb_t * exit_cb)
{
    benchmark_exit_cb = exit_cb;
}

void lv_demo_benchmark_set_max_speed(bool en)
{
    run_max_speed = en;
}

/**********************
 *   STATIC FUNCTIONS
 **********************/

static void monitor_cb(lv_disp_drv_t * drv, uint32_t time, uint32_t px)
{
    LV_UNUSED(drv);
    LV_UNUSED(px);
    if(opa_mode) {
        scenes[scene_act].refr_cnt_opa ++;
        scenes[scene_act].time_sum_opa += time;
    }
    else {
        scenes[scene_act].refr_cnt_normal ++;
        scenes[scene_act].time_sum_normal += time;
    }

    //    lv_obj_invalidate(lv_scr_act());
}

static void generate_report(void)
{
    uint32_t weight_sum = 0;
    uint32_t weight_normal_sum = 0;
    uint32_t weight_opa_sum = 0;
    uint32_t fps_sum = 0;
    uint32_t fps_normal_sum = 0;
    uint32_t fps_opa_sum = 0;
    uint32_t i;
    for(i = 0; scenes[i].create_cb; i++) {
        fps_normal_sum += scenes[i].fps_normal * scenes[i].weight;
        weight_normal_sum += scenes[i].weight;

        uint32_t w = LV_MAX(scenes[i].weight / 2, 1);
        fps_opa_sum += scenes[i].fps_opa * w;
        weight_opa_sum += w;
    }


    fps_sum = fps_normal_sum + fps_opa_sum;
    weight_sum = weight_normal_sum + weight_opa_sum;

    uint32_t fps_weighted = fps_sum / weight_sum;
    uint32_t fps_normal_unweighted = fps_normal_sum / weight_normal_sum;
    uint32_t fps_opa_unweighted = fps_opa_sum / weight_opa_sum;

    uint32_t opa_speed_pct = (fps_opa_unweighted * 100) / fps_normal_unweighted;

    if(NULL != benchmark_finished_cb) {
        (*benchmark_finished_cb)();
    }

    lv_obj_clean(lv_scr_act());
    scene_bg = NULL;


    lv_obj_set_flex_flow(lv_scr_act(), LV_FLEX_FLOW_COLUMN);

    title = lv_label_create(lv_scr_act());
    lv_label_set_text_fmt(title, "Weighted FPS: %"LV_PRIu32, fps_weighted);

    subtitle = lv_label_create(lv_scr_act());
    lv_label_set_text_fmt(subtitle, "Opa. speed: %"LV_PRIu32"%%", opa_speed_pct);

    lv_coord_t w = lv_obj_get_content_width(lv_scr_act());
    lv_obj_t * table = lv_table_create(lv_scr_act());
    //        lv_obj_clean_style_list(table, LV_PART_MAIN);
    lv_table_set_col_cnt(table, 2);

    lv_table_set_col_width(table, 0, (w * 3) / 4 - 3);
    lv_table_set_col_width(table, 1, w  / 4 - 3);
    lv_obj_set_width(table, lv_pct(100));
    lv_obj_set_style_min_height(table, 28, LV_PART_ITEMS);
    lv_obj_set_style_max_height(table, 28, LV_PART_ITEMS);

    create_home_button(lv_scr_act());


    //        static lv_style_t style_cell_slow;
    //        static lv_style_t style_cell_very_slow;
    //        static lv_style_t style_cell_title;
    //
    //        lv_style_init(&style_cell_title);
    //        lv_style_set_bg_color(&style_cell_title, LV_STATE_DEFAULT, lv_palette_main(LV_PALETTE_GREY));
    //        lv_style_set_bg_opa(&style_cell_title, LV_STATE_DEFAULT, LV_OPA_50);
    //
    //        lv_style_init(&style_cell_slow);
    //        lv_style_set_text_color(&style_cell_slow, LV_STATE_DEFAULT, LV_COLOR_ORANGE);
    //
    //        lv_style_init(&style_cell_very_slow);
    //        lv_style_set_text_color(&style_cell_very_slow, LV_STATE_DEFAULT, lv_palette_main(LV_PALETTE_RED));

    //        lv_obj_add_style(table, LV_TABLE_PART_CELL2, &style_cell_slow);
    //        lv_obj_add_style(table, LV_TABLE_PART_CELL3, &style_cell_very_slow);
    //        lv_obj_add_style(table, LV_TABLE_PART_CELL4, &style_cell_title);


    uint16_t row = 0;
    lv_table_add_cell_ctrl(table, row, 0, LV_TABLE_CELL_CTRL_MERGE_RIGHT);
    lv_table_set_cell_value(table, row, 0, "Slow but common cases");
    //        lv_table_set_cell_type(table, row, 0, 4);

    LV_LOG("\r\n"
           "LVGL v%d.%d.%d " LVGL_VERSION_INFO
           " Benchmark (in csv format)\r\n",
           LVGL_VERSION_MAJOR, LVGL_VERSION_MINOR, LVGL_VERSION_PATCH);
    LV_LOG("Weighted FPS: %"LV_PRIu32"\r\n", fps_weighted);
    LV_LOG("Opa. speed: %"LV_PRIu32"%%\r\n", opa_speed_pct);

