GigaDevice-GD32-MCU/GD32H759_EVAL_LVGL/Utilities/Third_Party/lvgl/demos/benchmark/lv_demo_benchmark.c
    row++;
    char buf[256];
    for(i = 0; scenes[i].create_cb; i++) {

        if(scenes[i].fps_normal < 20 && scenes[i].weight >= 10) {
            lv_table_set_cell_value(table, row, 0, scenes[i].name);

            lv_snprintf(buf, sizeof(buf), "%"LV_PRIu32, scenes[i].fps_normal);
            lv_table_set_cell_value(table, row, 1, buf);

            //                lv_table_set_cell_type(table, row, 0, 2);
            //                lv_table_set_cell_type(table, row, 1, 2);

            //LV_LOG("%s,%s\r\n", scenes[i].name, buf);

            row++;
        }

        if(scenes[i].fps_opa < 20 && LV_MAX(scenes[i].weight / 2, 1) >= 10) {
            lv_snprintf(buf, sizeof(buf), "%s + opa", scenes[i].name);
            lv_table_set_cell_value(table, row, 0, buf);

            //LV_LOG("%s,", buf);

            lv_snprintf(buf, sizeof(buf), "%"LV_PRIu32, scenes[i].fps_opa);
            lv_table_set_cell_value(table, row, 1, buf);

            //                lv_table_set_cell_type(table, row, 0, 2);
            //                lv_table_set_cell_type(table, row, 1, 2);
            //LV_LOG("%s\r\n", buf);

            row++;
        }
    }

    /*No 'slow but common cases'*/
    if(row == 1) {
        lv_table_add_cell_ctrl(table, row, 0, LV_TABLE_CELL_CTRL_MERGE_RIGHT);
        lv_table_set_cell_value(table, row, 0, "All good");
        row++;
    }

    lv_table_add_cell_ctrl(table, row, 0, LV_TABLE_CELL_CTRL_MERGE_RIGHT);
    lv_table_set_cell_value(table, row, 0, "All cases");
    //        lv_table_set_cell_type(table, row, 0, 4);
    row++;

    for(i = 0; scenes[i].create_cb; i++) {
        lv_table_set_cell_value(table, row, 0, scenes[i].name);

        lv_snprintf(buf, sizeof(buf), "%"LV_PRIu32, scenes[i].fps_normal);
        lv_table_set_cell_value(table, row, 1, buf);

        if(scenes[i].fps_normal < 10) {
            //                lv_table_set_cell_type(table, row, 0, 3);
            //                lv_table_set_cell_type(table, row, 1, 3);
        }
        else if(scenes[i].fps_normal < 20) {
            //                lv_table_set_cell_type(table, row, 0, 2);
            //                lv_table_set_cell_type(table, row, 1, 2);
        }

        LV_LOG("%s,%s\r\n", scenes[i].name, buf);

        row++;

        lv_snprintf(buf, sizeof(buf), "%s + opa", scenes[i].name);
        lv_table_set_cell_value(table, row, 0, buf);

        LV_LOG("%s,", buf);

        lv_snprintf(buf, sizeof(buf), "%"LV_PRIu32, scenes[i].fps_opa);
        lv_table_set_cell_value(table, row, 1, buf);


        if(scenes[i].fps_opa < 10) {
            //                lv_table_set_cell_type(table, row, 0, 3);
            //                lv_table_set_cell_type(table, row, 1, 3);
        }
        else if(scenes[i].fps_opa < 20) {
            //                lv_table_set_cell_type(table, row, 0, 2);
            //                lv_table_set_cell_type(table, row, 1, 2);
        }

        LV_LOG("%s\r\n", buf);

        row++;
    }

    //        lv_page_set_scrl_layout(page, LV_LAYOUT_COLUMN_LEFT);
}

static void report_cb(lv_timer_t * timer)
{
    if(!benchmark_running) return;

    if(NULL != benchmark_finished_cb) {
        (*benchmark_finished_cb)();
    }

    if(opa_mode) {
        if(scene_act >= 0) {
            if(scenes[scene_act].time_sum_opa == 0) scenes[scene_act].time_sum_opa = 1;
            scenes[scene_act].fps_opa = (1000 * scenes[scene_act].refr_cnt_opa) / scenes[scene_act].time_sum_opa;
        }

        lv_label_set_text_fmt(subtitle, "Result : %"LV_PRId32" FPS",
                              scenes[scene_act].fps_opa);
        LV_LOG("Result of \"%s + opa\": %"LV_PRId32" FPS", scenes[scene_act].name,
               scenes[scene_act].fps_opa);
    }
    else {
        if(scenes[scene_act].time_sum_normal == 0) scenes[scene_act].time_sum_normal = 1;
        scenes[scene_act].fps_normal = (1000 * scenes[scene_act].refr_cnt_normal) / scenes[scene_act].time_sum_normal;

        lv_label_set_text_fmt(subtitle, "Result : %"LV_PRId32" FPS",
                              scenes[scene_act].fps_normal);
        LV_LOG("Result of \"%s\": %"LV_PRId32" FPS", scenes[scene_act].name,
               scenes[scene_act].fps_normal);
    }
}

static void scene_next_task_cb(lv_timer_t * timer)
{
    LV_UNUSED(timer);
    if(!benchmark_running) return;

    lv_obj_clean(scene_bg);

    if(opa_mode) {
        if(scene_act >= 0) {
            if(scenes[scene_act].time_sum_opa == 0) scenes[scene_act].time_sum_opa = 1;
            scenes[scene_act].fps_opa = (1000 * scenes[scene_act].refr_cnt_opa) / scenes[scene_act].time_sum_opa;
            if(scenes[scene_act].create_cb) scene_act++;    /*If still there are scenes go to the next*/
        }
        else {
            scene_act++;
        }
        opa_mode = false;
    }
    else {
        if(scenes[scene_act].time_sum_normal == 0) scenes[scene_act].time_sum_normal = 1;
        scenes[scene_act].fps_normal = (1000 * scenes[scene_act].refr_cnt_normal) / scenes[scene_act].time_sum_normal;
        opa_mode = true;
    }

    if(scenes[scene_act].create_cb) {
        lv_label_set_text_fmt(title, "%"LV_PRId32"/%d: %s%s", scene_act * 2 + (opa_mode ? 1 : 0),
                              (int)(dimof(scenes) * 2) - 2,  scenes[scene_act].name, opa_mode ? " + opa" : "");
        if(opa_mode) {
            lv_label_set_text_fmt(subtitle, "Result of \"%s\": %"LV_PRId32" FPS", scenes[scene_act].name,
                                  scenes[scene_act].fps_normal);
        }
        else {
            if(scene_act > 0) {
                lv_label_set_text_fmt(subtitle, "Result of \"%s + opa\": %"LV_PRId32" FPS", scenes[scene_act - 1].name,
                                      scenes[scene_act - 1].fps_opa);
            }
            else {
                lv_label_set_text(subtitle, "");
            }
        }

        rnd_reset();
        scenes[scene_act].create_cb();
        lv_timer_t * t = lv_timer_create(scene_next_task_cb, SCENE_TIME, NULL);
        lv_timer_set_repeat_count(t, 1);

